# Глобальные
gl_next = "▶️ Далее"
gl_back = "◀️ Назад"
gl_yes = "✅ Да"
gl_yep = "✅ угу"
gl_no = "❌ Нет"
gl_cancel = "❌ Отмена"
gl_error = "⚠️ Ошибка"
gl_try_again = "Попробовать снова"
gl_error_try_again = f"{gl_error}. {gl_try_again}."
gl_refresh = "🔄 Обновить"
gl_delete = "🗑️ Удалить"
gl_edit = "✏️ Редактировать"
gl_configure = "⚙️ Настроить"
gl_pcs = "шт."
gl_last_update = "Последнее обновление"

# Главное меню
mm_language = "🗣️ Язык"
mm_global = "⚙️ Глобальные переключатели"
mm_notifications = "🔔 Настройки уведомлений"
mm_autoresponse = "🤖 Настройки автовыдачи"
mm_autodelivery = "📦 Настройки авто-выдачи"
mm_blacklist = "🚫 Настройки черного списка"
mm_templates = "📝 Шаблоны ответов"
mm_greetings = "👋 Приветственное сообщение"
mm_order_confirm = "✅ Ответ на подтверждение заказа"
mm_review_reply = "⭐ Ответ на отзывы"
mm_new_msg_view = "✉️ Вид увед. о новых сообщениях"
mm_plugins = "🧩 Плагины"
mm_configs = "📁 Конфиги"
mm_authorized_users = "👥 Авторизованные пользователи"
mm_proxy = "🌐 Прокси"

# Глобальные переключатели
gs_autoraise = "{} Автоподнятие"
gs_autoresponse = "{} Автоответчик"
gs_autodelivery = "{} Авто-выдача"
gs_nultidelivery = "{} Мульти-выдача"
gs_autorestore = "{} Авто-восстановление"
gs_autodisable = "{} Деактивация лотов"
gs_old_msg_mode = "{} Старый режим получения сообщений"
gs_keep_sent_messages_unread = "{} Оставлять непрочитанным при отправке"

# Настройки уведомлений
ns_new_msg = "{} Новое сообщение"
ns_cmd = "{} Команда получена"
ns_new_order = "{} Новый заказ"
ns_order_confirmed = "{} Заказ подтвержден"
ns_lot_activate = "{} Лот восстановлен"
ns_lot_deactivate = "{} Лот деактивирован"
ns_delivery = "{} Товар выдан"
ns_raise = "{} Лоты подняты"
ns_new_review = "{} Новый отзыв"
ns_bot_start = "{} Запуск бота"
ns_other = "{} Прочее (плагины)"

# Настройки автоответчика
ar_edit_commands = "✏️ Редактировать существующие команды"
ar_add_command = "➕ Добавить команду / набор команд"
ar_to_ar = "🤖 Назад к настройкам автоответчика"
ar_to_mm = "📋 Назад в главное меню"
ar_edit_response = "✏️ Редактировать ответ"
ar_edit_notification = "✏️ Редактировать текст уведомления"
ar_notification = "{} Telegram уведомление"
ar_add_more = "➕ Добавить еще"
ar_add_another = "➕ Добавить другую"

# Настройки авто-выдачи
ad_edit_autodelivery = "🗳️ Редактировать авто-выдачу лотов"
ad_add_autodelivery = "➕ Привязать авто-выдачу к лоту"
ad_add_another_ad = "➕ Привязать другую"
ad_add_more_ad = "➕ Привязать еще"
ad_edit_goods_file = "📋 Редактировать файлы товаров"
ad_upload_goods_file = "⤴️ Загрузить файл товаров"
ad_create_goods_file = "➕ Создать файл товаров"
ad_to_ad = "📦 Назад к настройкам авто-выдачи"
ad_to_mm = "📋 Назад в главное меню"

# - Редактирование авто-выдачи
ea_edit_delivery_text = "✏️ Редактировать текст выдачи"
ea_link_goods_file = "⛓️ Привязать файл товаров"
ea_delivery = "{} Авто-выдача"
ea_multidelivery = "{} Мульти-выдача"
ea_restore = "{} Восстановление"
ea_deactivate = "{} Деактивация"
ea_test = "🗝️ Ключ авто-выдачи"
ea_more_test = "🗝️ Еще 1 ключ"
ea_link_another_gf = "⛓️ Другой файл"

# - Добавление авто-выдачи
fl_manual = "➕ Ввести вручную"

# - Файлы товаров
gf_add_goods = "➕ Добавить товары"
gf_download = "⤵️ Скачать"
gf_create_another = "➕ Создать другой"
gf_create_more = "➕ Создать еще"
gf_add_more = "➕ Добавить еще"
gf_try_add_again = "➕ Попробовать снова"

# Настройки черного списка
bl_autodelivery = "{} Не выдавать товары"
bl_autoresponse = "{} Не отвечать на команды"
bl_new_msg_notifications = "{} Не уведомлять о новых сообщениях"
bl_new_order_notifications = "{} Не уведомлять о новых заказах"
bl_command_notifications = "{} Не уведомлять о полученных командах"

# Шаблоны ответов
tmplt_add = "➕ Добавить шаблон"
tmplt_add_more = "➕ Добавить еще"
tmplt_add_another = "➕ Добавить другой"

# Настройки приветствия
gr_greetings = "{} Приветствовать пользователей"
gr_ignore_sys_msgs = "{} Игнорировать системные сообщения"
gr_only_new_chats = "{} Только в новых чатах"
gr_edit_message = "✏️ Изменить текст приветственного сообщения"
gr_edit_cooldown = "⏱️ Кулдаун: {} дн."

# Настройки ответа на подтверждение заказа
oc_watermark = "{} Водяной знак сообщений"
oc_send_reply = "{} Отправлять сообщение"
oc_edit_message = "✏️ Изменить текст сообщения"

# Настройки вида уведомлений о новых сообщениях
mv_incl_my_msg = "{} Отображать мои сообщения"
mv_incl_fp_msg = "{} Отображать сообщения FunPay"
mv_incl_bot_msg = "{} Отображать сообщения бота"
mv_only_my_msg = "{} Увед., если сообщ. только от меня"
mv_only_fp_msg = "{} Увед., если сообщ. только от FP"
mv_only_bot_msg = "{} Увед., если сообщ. только от бота"
mv_show_image_name = "{} Отображать названия изображений"

# Плагины
pl_add = "➕ Добавить плагин"
pl_activate = "Активировать"
pl_deactivate = "Деактивировать"
pl_commands = "⌨️ Команды"
pl_settings = "⚙️ Настройки"

# Конфиги
cfg_download_main = "⤵️ Скачать основной конфиг"
cfg_download_ar = "⤵️ Скачать конфиг автоответчика"
cfg_download_ad = "⤵️ Скачать конфиг авто-выдачи"
cfg_upload_main = "⤴️ Загрузить основной конфиг"
cfg_upload_ar = "⤴️ Загрузить конфиг автоответчика"
cfg_upload_ad = "⤴️ Загрузить конфиг авто-выдачи"

# Авторизованные пользователи
tg_block_login = "{} Блокировать входы по паролю"

# Прокси
prx_proxy_add = "➕ Добавить прокси"

# Ссылки
lnk_github = "🛠️ Создать своего FunPay бота"
lnk_updates = "🔄 Обновления"
lnk_chat = "💬 Чат"

# Объявления
an_an = "{} Объявления"
an_ad = "{} Реклама"

# Новый заказ
ord_refund = "💸 Сделать возврат"
ord_open = "🌐 Открыть страницу заказа"
ord_answer = "📨 Ответить"
ord_templates = "📝 Шаблоны"

# Новое сообщение
msg_reply = "📨 Ответить"
msg_reply2 = "📨 Ответить"
msg_templates = "📝 Шаблоны"
msg_more = "➕ Еще"

# Тексты сообщений
access_denied = "👋 Привет, <b><i>{}</i></b>!\n\n❌ Вы неавторизованный пользователь.\n\n" \
                "🔑 Отправьте мне <u><b>секретный ключ</b></u>, который вы ввели при первоначальной настройке, чтобы " \
                "получить доступ к панели управления."

access_granted = "🔓 Доступ предоставлен!\n\n" \
                 "🔕 Имейте в виду, что я <b><u>не отправляю никаких уведомлений в этот чат</u></b>.\n\n" \
                 "🔔 Вы можете настроить уведомления для <b><u>этого чата</u></b> в меню настроек.\n\n" \
                 "⚙️ Чтобы открыть меню настроек <i>FunPay Cardinal</i>, отправьте мне /menu."

access_granted_notification = "<b>🚨 ВНИМАНИЕ! 🚨\n\n\n</b>" * 3 + "\n\n\n🔐 \"<a href=\"tg://user?id={1}\"> {0} </a>\" <b>(ID: {1}) только что получил доступ к Telegram панели управления! 🔓</b>"

param_disabled = "❌ Этот параметр отключен глобально и не может быть изменен для этого лота.\n\n" \
                 "❔ Переключение глобальных параметров доступно в меню глобальных переключателей " \
                 "(/menu -> ⚙️ Глобальные переключатели)."

old_mode_help = """<b>Новый режим получения сообщений</b>
✅ <i>FPC</i> получает полную историю чата и видит все данные о всех новых сообщениях.
✅ <i>FPC</i> может видеть изображения в чате и пересылать их в <i>Telegram</i> чат.
✅ <i>FPC</i> может точно определить, кто написал, были ли это вы, ваш собеседник или третье лицо (арбитр).
❌ Поскольку <i>FPC</i> получает полную историю чата для обнаружения новых сообщений, чат становится "прочитанным" (не горит оранжевым).

<b>Старый режим получения сообщений</b>
✅ Чаты, которые вы лично не прочитали, остаются непрочитанными (горят оранжевым).
✅ Работает немного быстрее, чем новый режим.
❌ <i>FPC</i> не получает полную историю чата, поэтому видит только последнее сообщение. Если пользователь быстро напишет несколько сообщений, <i>FPC</i> увидит только последнее.
❌ <i>FPC</i> не может видеть изображения в чате и пересылать их в <i>Telegram</i> чат.
❌ <i>FPC</i> не может точно определить, кто написал: вы или человек, с которым вы общаетесь. Если чат не прочитан, то сообщение от собеседника, иначе от вас. Однако, если вы просматриваете чат при получении сообщений, эта логика иногда может не сработать. Также <i>FPC</i> не сможет определить, если третье лицо (арбитр) написало в чат.

❗ Если вы нажмете кнопку <code>Еще</code> в уведомлении о новом сообщении, <i>FPC</i> "прочитает" чат и покажет последние 15 сообщений, включая изображения. <i>FPC</i> также сможет определить, кто автор сообщений."""

bot_started = """✅ Telegram бот запущен!\n
✅ Вы можете <b><u>настроить конфигурации</u></b> и <b><u>полностью использовать функциональность <i>Telegram</i> бота.</u></b>.\n
❌ <i>FunPay Cardinal</i> еще не инициализирован и ни одна из его функций не работает.\n
🔃 Как только <i>FunPay Cardinal</i> инициализируется, это сообщение изменится.\n
📋 Если <i>FPC</i> долго не инициализируется, проверьте логи с помощью /logs"""

poc_init = """✅ <b><u>Playerok Cardinal инициализирован!</u></b>\n
ℹ️ <b><i>Версия:</i></b> <code>{}</code>
👑 <b><i>Аккаунт:</i></b>  <code>{}</code> | <code>{}</code>
💰 <b><i>Баланс:</i></b> <code>{}₽, {}$, {}€</code>
📊 <b><i>Активные заказы:</i></b>  <code>{}</code>

💬 <b><i>Telegram чат:</i></b> @playerok_cardinall
🧩 <b><i>Плагины:</i></b> @KaDerix_Shop_Bot
👨‍💻 <b><i>Разработчик:</i></b> @KaDerix"""

create_test_ad_key = "Введите название лота, авто-выдачу которого вы хотите протестировать."

test_ad_key_created = """✅ Одноразовый ключ для выдачи <code>{}</code> создан.\n
Отправьте команду снизу в чат с пользователем, которому вы хотите выдать товар.\n
<code>!автовыдача {}</code>"""

about = """<b>🐦 Playerok Cardinal 🐦 v{}</b>\n
<i>Telegram чат:</i> @playerok_cardinall
<i>Плагины:</i> @KaDerix_Shop_Bot
<i>Разработчик:</i> @KaDerix"""

sys_info = """<b><u>Сводка данных</u></b>

<b>CPU:</b>
{}
    Используется <i>FPC</i>: <code>{}%</code>

<b>RAM:</b>
    Всего:  <code>{} MB</code>
    Используется:  <code>{} MB</code>
    Свободно:  <code>{} MB</code>
    Используется <i>FPC</i>:  <code>{} MB</code>

<b>Прочее:</b>
    Время работы:  <code>{}</code>
    Chat ID:  <code>{}</code>"""

act_blacklist = "Введите имя пользователя, которое вы хотите добавить в черный список."
already_blacklisted = "❌ <code>{}</code> уже в черном списке."
user_blacklisted = "✅ <code>{}</code> добавлен в черный список."
act_unban = "Введите имя пользователя, которое вы хотите удалить из черного списка."
not_blacklisted = "❌ <code>{}</code> не в черном списке."
user_unbanned = "✅ <code>{}</code> больше не в черном списке."
blacklist_empty = "❌ Черный список пуст."

act_proxy = "Введите прокси в формате <u>логин:пароль@ip:порт</u> или <u>ip:порт</u>."
proxy_already_exists = "❌ Прокси <code>{}</code> уже существует."
proxy_added = "✅ Прокси <u>{}</u> успешно добавлен."
proxy_format = "❌ Прокси должны быть в формате <u>логин:пароль@ip:порт</u> или <u>ip:порт</u>."
proxy_adding_error = "❌ Произошла ошибка при добавлении прокси."
proxy_undeletable = "❌ Этот прокси нельзя удалить, так как он сейчас используется."

act_edit_watermark = "Введите новый текст водяного знака. Например:\n{}\n" \
                     "<code>𝓟𝓵𝓪𝔂𝓮𝓻𝓸𝓴 𝓒𝓪𝓻𝓭𝓲𝓷𝓪𝓵</code>\n" \
                     "<code>ℙ𝕝𝕒𝕪𝕖𝕣𝕠𝕜 ℂ𝕒𝕣𝕕𝕚𝕟𝕒𝕝</code>\n<code>Ｐｌａｙｅｒｏｋ Ｃａｒｄｉｎａｌ</code>\n" \
                     "<code>ᴘʟᴀʏᴇʀᴏᴋ ᴄᴀʀᴅɪɴᴀʟ</code>\n<code>🅿🅻🅰🆈🅴🆁🅾🅺 🅲🅰🆁🅳🅸🅽🅰🅻</code>\n" \
                     "<code>Ⓟⓛⓐⓨⓔⓡⓞⓚ Ⓒⓐⓡⓓⓘⓝⓐⓛ</code>\n<code>𝐏𝐥𝐚𝐲𝐞𝐫𝐨𝐤 𝐂𝐚𝐫𝐝𝐢𝐧𝐚𝐥</code>\n" \
                     "<code>𝗣𝗹𝗮𝘆𝗲𝗿𝗼𝗸 𝗖𝗮𝗿𝗱𝗶𝗻𝗮𝗹</code>\n<code>𝘗𝘭𝘢𝘺𝘦𝘳𝘰𝘬 𝘊𝘢𝘳𝘥𝘪𝘯𝘢𝘭</code>\n" \
                     "<code>𝙋𝙡𝙖𝙮𝙚𝙧𝙤𝙠 𝘾𝙖𝙧𝙙𝙞𝙣𝙖𝙡</code>\n<code>𝙿𝚕𝚊𝚢𝚎𝚛𝚘𝚔 𝙲𝚊𝚛𝚍𝚒𝚗𝚊𝚕</code>\n" \
                     "<code>ᑭᒪᗩYᗴᖇOᖴ ᑕᗩᖇᗪIᑎᗩᒪ</code>\n" \
                     "<code>Playerok Cardinal</code>\n<code>[Playerok / Cardinal]</code>\n" \
                     "<code>🤖</code>\n<code>🎮</code>\n\n" \
                     "Вы можете нажать на примеры, чтобы скопировать и отредактировать их по своему вкусу.\nОбратите внимание, что на Playerok эмодзи " \
                     "🎮 выглядит иначе, чем в Telegram." \
                     "\n\nЧтобы удалить водяной знак, отправьте <code>-</code>."
watermark_changed = "✅ Водяной знак сообщений изменен."
watermark_deleted = "✅ Водяной знак сообщений удален."
watermark_error = "❌ Неверный водяной знак."

logfile_not_found = "❌ Файл логов не найден."
logfile_sending = "Отправка файла логов (это может занять некоторое время)..."
logfile_error = "❌ Не удалось отправить файл логов."
logfile_deleted = "🗑️ Удалено {} файл(ов) логов."

update_no_tags = "❌ Не удалось получить список версий. Попробуйте позже."
update_lasted = "✅ У вас последняя версия Playerok Cardinal {}"
update_get_error = "❌ Не удалось получить информацию о новой версии. Попробуйте позже."
update_available = "<b><u>Доступна новая версия!</u></b>\n\n\n{}\n\n{}"
update_update = "Для обновления введите команду /update"
update_backup = "✅ Резервная копия конфигов, хранилища и плагинов <code>backup.zip</code>.\n\n" \
                "⚠️ НЕ ОТПРАВЛЯЙТЕ этот архив НИКОМУ. Он содержит АБСОЛЮТНО ВСЕ содержимое и настройки бота (включая golden_key и файлы товаров)."
update_backup_error = "❌ Не удалось создать резервную копию конфигов, хранилища и плагинов."
update_backup_not_found = "❌ Резервная копия не найдена."
update_downloaded = "✅ Обновление {} загружено (пропущено {} элементов). Установка..."
update_download_error = "❌ Произошла ошибка при загрузке обновления."
update_done = "✅ Обновление установлено! Перезапустите FPC командой /restart."
update_done_exe = "✅ Обновление установлено! Новый <code>FPC.exe</code> находится в папке <code>update</code>. " \
                  "Выключите <i>FPC</i>, замените старый <code>FPC.exe</code> на новый и запустите <code>Start.bat</code>. "
update_install_error = "❌ Произошла ошибка при установке обновления."

send_backup = "Отправьте мне резервную копию.\n\n<b>⚠️ ВНИМАНИЕ! Загрузка резервных копий из ненадежных источников может привести к серьезным последствиям.</b>"

restarting = "Перезапуск..."
power_off_0 = """<b><u>Вы уверены, что хотите выключить меня?</u></b>\n
Вы <b><u>не сможете</u></b> включить меня через <i>Telegram</i>!"""
power_off_1 = "Я спрошу еще раз, на всякий случай.\n\n<b><u>Вы уверены в этом?</u></b>"
power_off_2 = """Просто для протокола:
вам придется пойти на сервер или к своему компьютеру (или туда, где вы меня держите) и запустить меня вручную!"""
power_off_3 = "Не то чтобы я навязываюсь, но если вы хотите применить изменения к основному конфигу, " \
              "вы можете просто перезапустить меня командой /restart."
power_off_4 = "Вы вообще читаете мои сообщения? Давайте проверим: да = нет, нет = да." \
              "Я уверен, что вы даже не читаете мои сообщения, но я пишу здесь важную информацию."
power_off_5 = "Черт возьми?.."
power_off_6 = "Хорошо, хорошо, я выключаюсь..."
power_off_cancelled = "Выключение отменено."
power_off_error = "❌ Эта кнопка не принадлежит этой сессии.\nВызовите это меню снова."

enter_msg_text = "Введите текст сообщения."
msg_sent = "✅ Сообщение отправлено в чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>."
msg_sent_short = "✅ Сообщение отправлено."
msg_sending_error = "❌ Не удалось отправить сообщение в чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>."
msg_sending_error_short = "❌ Не удалось отправить сообщение в чат."
send_img = "Отправьте мне изображение."

greeting_changed = "✅ Текст приветствия изменен."
greeting_cooldown_changed = "✅ Кулдаун приветственного сообщения изменен: {} дн."
order_confirm_changed = "✅ Текст ответа на подтверждение заказа изменен!"
review_reply_changed = "✅ Текст ответа на {} отзыв изменен!"
review_reply_empty = "❌ Текст ответа на {} отзыв не установлен."
review_reply_text = "Текст ответа на {} отзыв:\n<code>{}</code>"

get_chat_error = "❌ Не удалось получить данные чата."
viewing = "Просмотр"
you = "Вы"
support = "поддержка"
photo = "Фото"

refund_attempt = "❌ Не удалось вернуть заказ <code>#{}</code>.\n<code>{}</code> попыток осталось."
refund_error = "❌ Не удалось вернуть заказ <code>#{}</code>."
refund_complete = "✅ Заказ #{} возвращен."

updating_profile = "Обновление статистики аккаунта (это может занять некоторое время)..."
profile_updating_error = "❌ Не удалось обновить статистику аккаунта."

act_change_token = "Введите токен"
token_changed = "✅ токен успешно изменен{}.\n"
token_changed2 = "Перезапустите бота командой /restart."
token_incorrect_format = "❌ Неверный формат токена. Пожалуйста, попробуйте снова."
token_error = "❌ Авторизация не удалась. Возможно, токен неверен?"

ad_lot_not_found_err = "❌ Лот с индексом <code>{}</code> не найден."
ad_already_ad_err = "❌ Лот <code>{}</code> уже настроен для авто-выдачи."
ad_lot_already_exists = "❌ У лота <code>{}</code> уже есть привязанная авто-выдача."
ad_lot_linked = "✅ Авто-выдача привязана к лоту <code>{}</code>."
ad_link_gf = "Введите название файла товаров.\nОтправьте <code>-</code>, если вы хотите отвязать файл товаров.\n\n" \
             "Если файл товаров не существует, он будет создан автоматически."
ad_gf_unlinked = "✅ Файл товаров успешно отвязан от <code>{}</code>."
ad_gf_linked = "✅ Файл товаров <code>storage/products/{}</code> привязан к <code>{}</code>."
ad_gf_created_and_linked = "✅ Файл товаров <code>storage/products/{}</code> <b><u>создан</u></b> и привязан к <code>{}</code>."
ad_creating_gf = "🔄 Создание файла товаров <code>storage/products/{}</code>..."
ad_product_var_err = "❌ К лоту <code>{}</code> привязан файл товаров, но в тексте выдачи нет переменной <code>$product</code>."
ad_product_var_err2 = "❌ Нельзя привязать файл товаров, потому что в тексте выдачи отсутствует переменная <code>$product</code>."
ad_text_changed = "✅ Текст выдачи <code>{}</code> изменен на <code>{}</code>."
ad_updating_lots_list = "Обновление данных о лотах и категориях (это может занять некоторое время)..."
ad_lots_list_updating_err = "❌ Не удалось обновить данные о лотах и категориях."
gf_not_found_err = "❌ Файл товаров с индексом <code>{}</code> не найден."
copy_lot_name = "Отправьте название лота точно так, как на FunPay."

act_create_gf = "Введите название нового файла товаров."
gf_name_invalid = "❌ Неверное имя файла.\n\n" \
                  "В имени разрешены только <b><u>английские</u></b> и <b><u>русские</u></b> символы," \
                  "а также <code>_</code>, <code>-</code> и <code>пробел</code>."
gf_already_exists_err = "❌ Файл товаров <code>{}</code> уже существует."
gf_creation_err = "❌ Произошла ошибка при создании файла <code>{}</code>."
gf_created = "✅ Файл товаров <code>storage/products/{}</code> создан."
gf_amount = "Количество товаров"
gf_uses = "Используется в лотах"
gf_send_new_goods = "Введите товары, которые вы хотите добавить в файл товаров.\n\nКаждая новая строка (<code>Shift+Enter</code>) - это новый товар."
gf_add_goods_err = "❌ Не удалось добавить новые товары."
gf_new_goods = "✅ <code>{}</code> товар(ов) добавлено в <code>storage/products/{}</code>."
gf_empty_error = "❌ Файл storage/products/{} пуст."
gf_linked_err = "❌ Файл <code>storage/products/{}</code> привязан к одному или нескольким лотам.\n" \
                "Перед удалением этого файла товаров отвяжите его от всех лотов."
gf_deleting_err = "❌ Не удалось удалить файл <code>storage/products/{}</code>."

ar_cmd_not_found_err = "❌ Команда с индексом <code>{}</code> не найдена."
ar_subcmd_duplicate_err = "❌ Команда <code>{}</code> дублируется в сети команд."
ar_cmd_already_exists_err = "❌ Команда <code>{}</code> уже существует."
ar_enter_new_cmd = "Введите новую команду (или несколько команд через <code>|</code>)."
ar_cmd_added = "Добавлена новая команда <code>{}</code>."
ar_response_text = "Текст ответа"
ar_notification_text = "Текст уведомления"
ar_response_text_changed = "✅ Текст ответа команды <code>{}</code> изменен на <code>{}</code>."
ar_notification_text_changed = "✅ Текст уведомления команды <code>{}</code> изменен на <code>{}</code>"

cfg_main = "Основной конфиг.\n\n⚠️ НЕ ОТПРАВЛЯЙТЕ этот файл НИКОМУ."
cfg_ar = "Конфиг автоответчика."
cfg_ad = "Конфиг авто-выдачи."
cfg_not_found_err = "❌ Конфиг {} не найден."
cfg_empty_err = "❌ Конфиг {} пуст."

tmplt_not_found_err = "❌ Шаблон ответа с индексом <code>{}</code> не найден."
tmplt_already_exists_err = "❌ Такой шаблон уже существует."
tmplt_added = "✅ Шаблон добавлен."
tmplt_msg_sent = "✅ Сообщение отправлено в чат <a href=\"https://funpay.com/chat/?node={}\">{}</a>.\n\n<code>{}</code>"

pl_not_found_err = "❌ Плагин с UUID <code>{}</code> не найден."
pl_file_not_found_err = "❌  Файл <code>{}</code> не найден.\nПерезапустите <i>FPC</i> командой /restart."
pl_commands_list = "Список команд плагина <b><i>{}</i></b>."
pl_author = "Разработчик"
pl_new = "Отправьте мне плагин.\n\n<b>⚠️ ВНИМАНИЕ! Загрузка плагинов из сомнительных источников может привести к печальным последствиям.\n" \
         "@KaDerix_Shop_Bot решает большинство потенциальных проблем.</b>"

au_user_settings = "Настройки для пользователя {}"
adv_poc = "😎 Playerok Cardinal (POC) - лучший бот для Playerok"
adv_description = """🐦 Playerok Cardinal v{}🐦

🤖 Автоматическая выдача товаров
🚀 Автоподнятие лотов
💬 Автоответ на подготовленные команды
🔄 Автовосстановление лотов после продажи
📦 Автодеактивация лотов при отсутствии товаров
🔝 Постоянное присутствие онлайн
📲 Уведомления в Telegram
🕹️ Полная панель управления в Telegram
🧩 Плагины
🌟 И многое другое...

🛠️ Playerok Cardinal (POC)
🧩 Плагины: @KaDerix_Shop_Bot
💬 Чат: @playerok_cardinall
👨‍💻 Разработчик: @KaDerix"""

# - Описания меню
desc_main = "Выберите категорию настроек."
desc_lang = desc_main
desc_gs = "Здесь вы можете включить и выключить основные функции <i>FPC</i>."
desc_ns = """Здесь вы можете настроить уведомления.\n
<b><u>Настройки отдельны для каждого <i>Telegram</i> чата!</u></b>\n
Текущий Chat ID: <code>{}</code>"""
desc_bl = "Здесь вы можете установить ограничения для пользователей из черного списка."
desc_ar = "Здесь вы можете добавить команды или отредактировать существующие."
desc_ar_list = "Выберите команду / набор команд, которые вас интересуют."

desc_ad = "Здесь вы можете изменить настройки авто-выдачи, загрузить/скачать файлы товаров и т.д."
desc_ad_list = "Это список лотов, к которым привязана авто-выдача. Выберите интересующий вас лот."
desc_ad_fp_lot_list = "Это список лотов из вашего профиля FunPay. Выберите интересующий вас лот, чтобы привязать к нему авто-выдачу.\n" \
                      "Если лот отсутствует в списке, нажмите кнопку  <code>🔄 Обновить</code>.\n\n" \
                      "Последнее сканирование: {}"
desc_gf = "Выберите интересующий вас файл товаров."

desc_mv = "Здесь вы можете настроить вид уведомлений о новых сообщениях."
desc_gr = "Здесь вы можете настроить приветственное сообщение для новых пользователей.\n\n<b>Текст приветствия:</b>\n<code>{}</code>"
desc_oc = "Здесь вы можете настроить сообщение о подтверждении заказа.\n\n<b>Текст сообщения:</b>\n<code>{}</code>"
desc_or = "Здесь вы можете настроить ваш ответ на отзывы."
desc_an = "Здесь вы можете настроить уведомления об объявлениях."
desc_cfg = "Здесь вы можете скачать и загрузить конфиги."
desc_tmplt = "Здесь вы можете добавить и удалить шаблоны ответов."
desc_pl = "Здесь вы можете получить информацию о плагинах, а также настроить их.\n\n" \
          "⚠️ <b><u>После активации / деактивации / добавления / удаления плагина необходимо перезапустить бота!</u></b>" \
          " (/restart)"
desc_au = "Здесь вы можете настроить авторизацию в Telegram панели управления."
desc_proxy = "Здесь вы можете настроить прокси."

# - Описания команд
cmd_menu = "открыть настройки"
cmd_language = "изменить язык"
cmd_profile = "статистика аккаунта"
cmd_token = "изменить токен"
cmd_test_lot = "создать одноразовый ключ выдачи"
cmd_upload_chat_img = "(чат) загрузить изображение в FunPay"
cmd_upload_offer_img = "(лот) загрузить изображение в FunPay"
cmd_upload_plugin = "загрузить плагин"
cmd_ban = "добавить пользователя в черный список"
cmd_unban = "удалить пользователя из черного списка"
cmd_black_list = "черный список"
cmd_watermark = "изменить водяной знак сообщений"
cmd_logs = "скачать текущий файл логов"
cmd_del_logs = "удалить старые файлы логов"
cmd_about = "о текущей версии"
cmd_check_updates = "проверить обновления"
cmd_update = "обновиться до следующей версии"
cmd_sys = "информация о нагрузке системы"
cmd_create_backup = "создать резервную копию"
cmd_get_backup = "получить резервную копию"
cmd_upload_backup = "загрузить резервную копию"
cmd_restart = "перезапустить FPC"
cmd_power_off = "выключить FPC"

# - Описания переменных
v_edit_greeting_text = "Введите текст приветственного сообщения."
v_edit_greeting_cooldown = "Введите кулдаун приветственного сообщения (в днях)."
v_edit_order_confirm_text = "Введите текст ответа на подтверждение заказа."
v_edit_review_reply_text = "Введите текст ответа на {} отзыв."
v_edit_delivery_text = "Введите новый текст выдачи."
v_edit_response_text = "Введите новый текст ответа."
v_edit_notification_text = "Введите новый текст Telegram уведомления."
V_new_template = "Введите текст нового шаблона ответа."
v_list = "Список переменных"
v_date = "<code>$date</code> - текущая дата в формате <i>ДД.ММ.ГГГГ</i>."
v_date_text = "<code>$date_text</code> - текущая дата в формате <i>1 января</i>."
v_full_date_text = "<code>$full_date_text</code> - текущая дата в формате <i>1 января 2020</i>."
v_time = "<code>$time</code> - текущее время в формате <i>ЧЧ:ММ</i>."
v_full_time = "<code>$full_time</code> - текущее время в формате <i>ЧЧ:ММ:СС</i>."
v_photo = "<code>$photo=[PHOTO ID]</code> - фото. Вместо <code>[PHOTO ID]</code>, " \
          "введите ID фото, полученный командой /upload_chat_img."
v_sleep = "<code>$sleep=[TIME]</code> - задержка. Замените <code>[TIME]</code> " \
          "на время задержки в секундах."
v_order_id = "<code>$order_id</code> - ID заказа (без #)"
v_order_link = "<code>$order_link</code> - ссылка на заказ"
v_order_title = "<code>$order_title</code> - название заказа."
v_order_params = "<code>$order_params</code> - параметры заказа."
v_order_desc_and_params = "<code>$order_desc_and_params</code> - название и/или параметры заказа."
v_order_desc_or_params = "<code>$order_desc_or_params</code> - название или параметры заказа."
v_game = "<code>$game</code> - название игры."
v_category = "<code>$category</code> - название подкатегории."
v_category_fullname = "<code>$category_fullname</code> - полное название подкатегории (название подкатегории + название игры)."
v_product = "<code>$product</code> - товар(ы) из файла товаров. Работает только если файл товаров привязан."
v_chat_id = "<code>$chat_id</code> - ID чата."
v_chat_name = "<code>$chat_name</code> - имя чата."
v_message_text = "<code>$message_text</code> - текст сообщения собеседника."
v_username = "<code>$username</code> - имя пользователя собеседника."

# Тексты исключений
exc_param_not_found = "Опция \"{}\" не найдена."
exc_param_cant_be_empty = "Значение опции \"{}\" не может быть пустым."
exc_param_value_invalid = "Неверное значение опции \"{}\". Возможные значения: {}. Текущее значение: \"{}\"."
exc_goods_file_not_found = "Указанный файл товаров \"{}\" не найден."
exc_goods_file_is_empty = "Нет товаров в файле товаров \"{}\"."
exc_not_enough_items = "Недостаточно товаров в файле товаров \"{}\". Запрошено: {}, доступно: {}."
exc_no_product_var = "Указан \"productsFileName\", но переменная $product отсутствует в \"response\"."
exc_no_section = "Секция не существует."
exc_section_duplicate = "Найдена дублирующаяся секция."
exc_cmd_duplicate = "Команда или подкоманда \"{}\" уже существует."
exc_cfg_parse_err = "Ошибка в конфиге {}, в секции [{}]: {}"
exc_plugin_field_not_found = "Не удалось загрузить плагин \"{}\": обязательное поле \"{}\" не существует."

# Логи
log_tg_initialized = "$MAGENTATelegram бот инициализирован."
log_tg_started = "$CYANTelegram бот $YELLOW@{}$CYAN запущен."
log_tg_handler_error = "Произошла ошибка при выполнении обработчика Telegram бота."
log_tg_update_error = "Произошла ошибка ({}) при получении обновлений Telegram (возможно, неверный токен?)."
log_tg_notification_error = "Произошла ошибка при отправке уведомления в чат $YELLOW{}$RESET."
log_access_attempt = "$MAGENTA@{} (ID: {})$RESET пытался получить доступ к панели управления. Я держу его как могу!"
log_click_attempt = "$MAGENTA@{} (ID: {})$RESET нажимает кнопки панели управления в $MAGENTA@{} (ID: {})$RESET. Ему это не удастся!"
log_access_granted = "$MAGENTA@{} (ID: {})$RESET получил доступ к панели управления."
log_new_ad_key = "$MAGENTA@{} (ID: {})$RESET создал ключ для выдачи $YELLOW{}$RESET: $CYAN{}$RESET."
log_user_blacklisted = "$MAGENTA@{} (ID: {})$RESET добавил $YELLOW{}$RESET в черный список."
log_user_unbanned = "$MAGENTA@{} (ID: {})$RESET удалил $YELLOW{}$RESET из черного списка."
log_watermark_changed = "$MAGENTA@{} (ID: {})$RESET изменил водяной знак сообщений на $YELLOW{}$RESET."
log_watermark_deleted = "$MAGENTA@{} (ID: {})$RESET удалил водяной знак сообщений."
log_greeting_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст приветствия на $YELLOW{}$RESET."
log_greeting_cooldown_changed = "$MAGENTA@{} (ID: {})$RESET изменил кулдаун приветственного сообщения на $YELLOW{}$RESET дн."
log_order_confirm_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст ответа на подтверждение заказа на $YELLOW{}$RESET."
log_review_reply_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст ответа на {}-звездочный отзыв на $YELLOW{}$RESET."
log_param_changed = "$MAGENTA@{} (ID: {})$RESET изменил значение $CYAN{}$RESET в секции $YELLOW[{}]$RESET на $YELLOW{}$RESET."
log_notification_switched = "$MAGENTA@{} (ID: {})$RESET переключил уведомления $YELLOW{}$RESET для чата $YELLOW{}$RESET на $CYAN{}$RESET."
log_ad_linked = "$MAGENTA@{} (ID: {})$RESET привязал авто-выдачу к лоту $YELLOW{}$RESET."
log_ad_text_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст выдачи $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ad_deleted = "$MAGENTA@{} (ID: {})$RESET удалил авто-выдачу из $YELLOW{}$RESET."
log_gf_created = "$MAGENTA@{} (ID: {})$RESET создал файл товаров $YELLOWstorage/products/{}$RESET."
log_gf_unlinked = "$MAGENTA@{} (ID: {})$RESET отвязал файл товаров от $YELLOW{}$RESET."
log_gf_linked = "$MAGENTA@{} (ID: {})$RESET привязал файл товаров $YELLOWstorage/products/{}$RESET к $YELLOW{}$RESET."
log_gf_created_and_linked = "$MAGENTA@{} (ID: {})$RESET создал и привязал файл товаров $YELLOWstorage/products/{}$RESET к $YELLOW{}$RESET."
log_gf_new_goods = "$MAGENTA@{} (ID: {})$RESET добавил $CYAN{}$RESET товар(ов) в $YELLOWstorage/products/{}$RESET."
log_gf_downloaded = "$MAGENTA@{} (ID: {})$RESET запросил файл товаров $YELLOWstorage/products/{}$RESET."
log_gf_deleted = "$MAGENTA@{} (ID: {})$RESET удалил файл товаров $YELLOWstorage/products/{}$RESET."
log_ar_added = "$MAGENTA@{} (ID: {})$RESET добавил новую команду $YELLOW{}$RESET."
log_ar_response_text_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст ответа команды $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ar_notification_text_changed = "$MAGENTA@{} (ID: {})$RESET изменил текст уведомления команды $YELLOW{}$RESET на $YELLOW\"{}\"$RESET."
log_ar_cmd_deleted = "$MAGENTA@{} (ID: {})$RESET удалил команду $YELLOW{}$RESET."
log_cfg_downloaded = "$MAGENTA@{} (ID: {})$RESET запросил конфиг $YELLOW{}$RESET."
log_tmplt_added = "$MAGENTA@{} (ID: {})$RESET добавил шаблон ответа $YELLOW\"{}\"$RESET."
log_tmplt_deleted = "$MAGENTA@{} (ID: {})$RESET удалил шаблон ответа $YELLOW\"{}\"$RESET."
log_pl_activated = "$MAGENTA@{} (ID: {})$RESET активировал плагин $YELLOW\"{}\"$RESET."
log_pl_deactivated = "$MAGENTA@{} (ID: {})$RESET деактивировал плагин $YELLOW\"{}\"$RESET."
log_pl_deleted = "$MAGENTA@{} (ID: {})$RESET удалил плагин $YELLOW\"{}\"$RESET."
log_pl_delete_handler_err = "Произошла ошибка при выполнении обработчика удаления плагина $YELLOW\"{}\"$RESET."

# Логи handlers.py
log_new_msg = "$MAGENTA┌──$RESET Новое сообщение в чате с $YELLOW{} (CID: {}):"
log_sending_greetings = "Пользователь $YELLOW{} (CID: {})$RESET написал впервые! Отправляю приветствие..."
log_new_cmd = "Получена команда $YELLOW{}$RESET в чате с пользователем $YELLOW{} (CID: {})$RESET."
ntfc_new_order = "💰 <b>Новый заказ:</b> <code>{}</code>\n\n<b><i>🙍‍♂️ Покупатель:</i></b>  <code>{}</code>\n" \
                 "<b><i>💵 Сумма заказа:</i></b>  <code>{}</code>\n<b><i>📇 ID:</i></b> <code>#{}</code>\n\n<i>{}</i>"
ntfc_new_order_not_in_cfg = "ℹ️ Товар не будет выдан, поскольку к лоту не привязана авто-выдача."
ntfc_new_order_ad_disabled = "ℹ️ Товар не будет выдан, поскольку авто-выдача отключена в глобальных переключателях."
ntfc_new_order_ad_disabled_for_lot = "ℹ️ Товар не будет выдан, поскольку авто-выдача отключена для данного лота."
ntfc_new_order_user_blocked = "ℹ️ Товар не будет выдан, поскольку пользователь находится в ЧС и включена блокировка авто-выдачи."
ntfc_new_order_will_be_delivered = "ℹ️ Товар будет выдан в ближайшее время."
ntfc_new_review = "🔮 Вы получили {} за заказ <code>{}</code>!\n\n💬<b>Отзыв:</b>\n<code>{}</code>{}"
ntfc_review_reply_text = "\n\n🗨️<b>Ответ:</b> \n<code>{}</code>"

# Логи cardinal.py
crd_proxy_detected = "Обнаружен прокси."
crd_checking_proxy = "Выполняю проверку прокси..."
crd_proxy_err = "Не удалось подключиться к прокси. Убедитесь, что данные введены правильно."
crd_proxy_success = "Прокси успешно проверен! IP-адрес: $YELLOW{}$RESET."
crd_acc_get_timeout_err = "Не удалось загрузить данные аккаунта: превышено время ожидания."
crd_acc_get_unexpected_err = "Произошла непредвиденная ошибка при получении данных аккаунта."
crd_try_again_in_n_secs = "Следующая попытка через {} секунд(-у/-ы)..."
crd_getting_profile_data = "Получаю данные о лотах и категориях..."
crd_profile_get_timeout_err = "Не удалось загрузить данные о лотах аккаунта: превышено время ожидания."
crd_profile_get_unexpected_err = "Произошла непредвиденная ошибка при получении данных о лотах и категориях."
crd_profile_get_too_many_attempts_err = "Произошла ошибка при получении данных о лотах аккаунта: превышено количество попыток ({})."
crd_profile_updated = "Обновлена информация о лотах профиля $YELLOW({})$RESET и категориях $YELLOW({})$RESET."
crd_tg_profile_updated = "Обновлена информация о лотах профиля $YELLOW({})$RESET и категориях $YELLOW({})$RESET (Telegram панель управления)."
crd_raise_time_err = "Не удалось поднять лоты категории $CYAN\"{}\"$RESET. FunPay говорит: \"{}\". Следующая попытка через {}."
crd_raise_unexpected_err = "Произошла непредвиденная ошибка при попытке поднять лоты категории $CYAN\"{}\"$RESET. Пауза на 10 секунд."
crd_raise_status_code_err = "Ошибка {} при поднятии лотов категории $CYAN\"{}\"$RESET. Пауза на 1 минуту..."
crd_lots_raised = "Все лоты в категории $CYAN\"{}\"$RESET подняты!"
crd_raise_wait_3600 = "Следующая попытка через {}."
crd_msg_send_err = "Произошла ошибка при отправке сообщения в чат $YELLOW{}$RESET."
crd_msg_attempts_left = "Осталось попыток: $YELLOW{}$RESET."
crd_msg_no_more_attempts_err = "Не удалось отправить сообщение в чат $YELLOW{}$RESET: превышено количество попыток."
crd_msg_sent = "Отправлено сообщение в чат $YELLOW{}."
crd_session_timeout_err = "Не удалось обновить сессию: превышено время ожидания."
crd_session_unexpected_err = "Произошла непредвиденная ошибка при обновлении сессии."
crd_session_no_more_attempts_err = "Не удалось обновить сессию: превышено количество попыток."
crd_session_updated = "Сессия обновлена."
crd_raise_loop_started = "$CYANЦикл автоподнятия запущен (это не означает, что автоподнятие включено)."
crd_raise_loop_not_started = "$CYANЦикл автоподнятия не был запущен, так как на аккаунте не обнаружено лотов."
crd_session_loop_started = "$CYANЦикл обновления сессии запущен."
crd_no_plugins_folder = "Папка плагинов не обнаружена."
crd_no_plugins = "Плагины не обнаружены."
crd_plugin_load_err = "Не удалось загрузить плагин {}."
crd_invalid_uuid = "Не удалось загрузить плагин {}: неверный UUID."
crd_uuid_already_registered = "UUID {} ({}) уже зарегистрирован."
crd_handlers_registered = "Обработчики из $YELLOW{}.py$RESET зарегистрированы."
crd_handler_err = "Произошла ошибка при выполнении обработчика."
crd_tg_au_err = "Не удалось обновить сообщение с информацией о пользователе: {}. Попробую без ссылки."

# Логи обновлений
upd_checking_tags = "Проверка тегов на GitHub..."
upd_github_repo = "Репозиторий: {}"
upd_github_error = "Ошибка GitHub API, код: {}"
upd_no_more_tags = "Больше тегов не найдено."
upd_found_current_tag = "Найден текущий тег: {}"
upd_no_tags_found = "Теги не найдены."
upd_tags_found = "Найдено тегов: {}"
upd_exception = "Исключение при проверке обновлений: {}"
upd_checking_releases = "Проверка релизов начиная с тега: {}"
upd_no_more_releases = "Больше релизов не найдено."
upd_found_tag = "Найден тег: {}"
upd_releases_found = "Найдено релизов: {}"
upd_no_releases_after_tag = "Нет релизов после тега {}"
upd_no_tags_api = "Не удалось получить теги из GitHub API"
upd_current_is_latest = "Текущий тег {} является последним"
upd_next_tag_found = "Следующий тег: {}"
upd_no_releases_data = "Не удалось получить данные релизов"
